import Foundation
struct Struct_J: Characters {
	var characters: [String]
	init(pinyin: String) {
		switch pinyin {
		case "ji":  characters = ["击", "圾", "基", "机", "畸", "积", "箕", "肌", "饥", "迹", "激", "讥", "鸡", "姬", "绩", "吉", "极", "棘", "辑", "籍", "集", "及", "急", "疾", "汲", "即", "嫉", "级", "挤", "几", "脊", "己", "蓟", "技", "冀", "季", "伎", "剂", "悸", "济", "寄", "寂", "计", "记", "既", "忌", "际", "妓", "继", "纪", "给", "稽", "缉", "祭", "藉", "期", "奇", "齐", "系"]
		case "jia":  characters = ["嘉", "枷", "佳", "加", "荚", "颊", "甲", "钾", "假", "稼", "架", "驾", "嫁", "夹", "贾", "价", "搅", "茄", "缴", "家"]
		case "jian":  characters = ["歼", "监", "坚", "尖", "笺", "间", "煎", "兼", "肩", "艰", "奸", "缄", "茧", "检", "柬", "碱", "拣", "捡", "简", "俭", "剪", "减", "荐", "鉴", "践", "贱", "键", "箭", "件", "健", "舰", "剑", "饯", "渐", "溅", "涧", "建", "槛", "见", "浅"]
		case "jiang":  characters = ["僵", "姜", "浆", "江", "疆", "蒋", "桨", "奖", "讲", "匠", "酱", "将", "降", "强"]
		case "jiao":  characters = ["椒", "礁", "焦", "胶", "交", "郊", "浇", "骄", "娇", "脚", "教", "轿", "较", "叫", "窖", "蕉", "嚼", "搅", "铰", "狡", "饺", "绞", "酵", "觉", "校", "矫", "侥", "角", "缴", "剿"]
		case "jie":  characters = ["揭", "接", "皆", "秸", "街", "阶", "截", "劫", "节", "杰", "捷", "睫", "竭", "洁", "结", "姐", "戒", "界", "借", "介", "疥", "诫", "届", "桔", "解", "藉", "芥"]
		case "jin":  characters = ["巾", "筋", "斤", "金", "今", "津", "襟", "紧", "锦", "仅", "谨", "进", "靳", "晋", "禁", "近", "烬", "浸", "尽", "劲"]
		case "jing":  characters = ["荆", "兢", "茎", "睛", "晶", "鲸", "京", "惊", "精", "经", "井", "警", "静", "境", "敬", "镜", "径", "痉", "靖", "竟", "竞", "净", "劲", "粳", "景", "颈"]
		case "jiong":  characters = ["炯", "窘"]
		case "jiu":  characters = ["揪", "究", "纠", "玖", "韭", "久", "灸", "九", "酒", "厩", "救", "旧", "臼", "舅", "咎", "就", "疚"]
		case "ju":  characters = ["鞠", "拘", "狙", "疽", "驹", "菊", "局", "矩", "举", "沮", "聚", "拒", "据", "巨", "具", "距", "踞", "锯", "俱", "惧", "炬", "剧", "车", "桔", "居", "咀", "句", "蛆", "足"]
		case "juan":  characters = ["捐", "鹃", "娟", "倦", "眷", "绢", "卷", "圈"]
		case "jue":  characters = ["撅", "攫", "抉", "掘", "倔", "爵", "决", "诀", "绝", "嚼", "觉", "角"]
		case "jun":  characters = ["菌", "钧", "军", "君", "峻", "俊", "竣", "郡", "骏", "均", "浚"]
		default:  characters = [""]
		}
	}
}