import Foundation
struct Struct_X: Characters {
	var characters: [String]
	init(pinyin: String) {
		switch pinyin {
		case "xi":  characters = ["昔", "熙", "析", "西", "硒", "矽", "晰", "嘻", "吸", "锡", "牺", "稀", "息", "希", "悉", "膝", "夕", "惜", "熄", "烯", "汐", "犀", "檄", "袭", "席", "习", "媳", "喜", "隙", "细", "栖", "溪", "铣", "洗", "系", "戏"]
		case "xia":  characters = ["瞎", "匣", "霞", "辖", "暇", "峡", "侠", "狭", "下", "虾", "厦", "夏", "吓"]
		case "xian":  characters = ["掀", "锨", "先", "仙", "鲜", "咸", "贤", "衔", "舷", "闲", "涎", "弦", "嫌", "显", "险", "现", "献", "县", "腺", "馅", "羡", "宪", "陷", "限", "线", "铣", "纤"]
		case "xiang":  characters = ["相", "厢", "镶", "香", "箱", "襄", "湘", "乡", "翔", "祥", "详", "想", "响", "享", "项", "橡", "像", "向", "象", "降", "巷"]
		case "xiao":  characters = ["萧", "硝", "霄", "哮", "销", "消", "宵", "晓", "小", "孝", "肖", "啸", "笑", "效", "削", "嚣", "淆", "校"]
		case "xie":  characters = ["楔", "些", "歇", "鞋", "协", "携", "胁", "谐", "写", "械", "卸", "蟹", "懈", "泄", "泻", "谢", "屑", "解", "蝎", "挟", "邪", "斜", "血", "叶", "契"]
		case "xin":  characters = ["薪", "芯", "锌", "欣", "辛", "新", "忻", "心", "衅", "信"]
		case "xing":  characters = ["星", "腥", "猩", "惺", "兴", "刑", "型", "形", "邢", "醒", "幸", "杏", "性", "姓", "省", "行"]
		case "xiong":  characters = ["兄", "凶", "胸", "匈", "汹", "雄", "熊"]
		case "xiu":  characters = ["休", "修", "羞", "朽", "嗅", "锈", "秀", "袖", "绣", "臭", "宿"]
		case "xu":  characters = ["墟", "需", "虚", "须", "徐", "许", "蓄", "酗", "叙", "旭", "序", "恤", "絮", "婿", "绪", "续", "戌", "嘘", "畜", "吁"]
		case "xuan":  characters = ["轩", "喧", "宣", "悬", "旋", "玄", "选", "癣", "眩", "绚"]
		case "xue":  characters = ["靴", "薛", "学", "穴", "雪", "削", "血"]
		case "xun":  characters = ["勋", "熏", "循", "旬", "询", "驯", "巡", "殉", "汛", "训", "讯", "逊", "迅", "浚", "寻"]
		default:  characters = [""]
		}
	}
}